d-emacs.org
#+TITLE: 🧬 D Emacs Station
#+PROPERTY: header-args:emacs-lisp :tangle ./gdk/i-home/configs/emacs/init.el :tangle-mode (identity #o444) :mkdirp yes
#+TOC: tables


** Todo Stuffs (Feel free to say/add something. I will be glad!
**** 😄 Finally Done.. Ooof
CLOSED: [2023-03-07 Tue 14:27]
:LOGBOOK:
- CLOSING NOTE [2023-03-07 Tue 14:27]
:END:
- [X] Ditch evil-mode, go pure Emacs way!
- [X] No need modeline nor dashboard, go zen-mode with minimal distraction
    PS : Used ~olivetti-mode~ and ~hide-mode-line-mode~
- [X] Clean and minimise unnecessary package/bloat
- [X] No need doom-themes too, use one theme (Either vivendi or Catppuccin)
- [X] Setup robust and extensive use for Rss feeds
- [X] Manage emacs nix-way.
  PS : Just managing packages in nix style. Init file is good enough as such.
    Benefits are :
  + package management becomes easy with just ~nixos-rebuild~
  + You get vterm, which wont build that easily in normal emacs config under nixos
- [X] Make README.org or improve this Config.org so it is informational to all
- [X] Share some cool stuffs with others and explain it very crisp and clearly
- [X] Learn elisp for enhancing some more stuffs

**** 😴 Planning  [1/3]
- [ ] Add daily quotes for ~initial-scratch-message~
- [ ] Learn more stuffs from Experienced and Master Users, like Purcell, bbsatov and others

** ✨ TLDWR - Features
/too long, don't wanna read/

Some of the highlights which you might wanna copy or take from this config :

1. RSS focused, has good workflow to read. You have bionic-reading too!
2. Smoother experience and made for Pure-Gtk, Wayland use
3. Zen, Distraction free text viewing experience (No mode-line)


* 🌅 Early-Init
#+begin_src emacs-lisp :noweb yes :tangle ./gdk/i-home/configs/emacs/early-init.el :tangle-mode (identity #o444) :mkdirp yes
  ;;; early-init.el --- Early initialization file -*- lexical-binding: t; -*-
  ;; ---
  ;; Filename: early-init.el
  ;; Description: Make emacs quicky
  ;; Author: Dilip
  ;; Copyright © 2023 Dilip
  ;; Version: 0.3
  ;; URL: https://github.com/idlip/d-nix
  ;; Keywords: Emacs early-init
  ;; Compatibility: emacs-version >= 29.1
  ;;
  ;; ---
  ;;
    ;;; Commentary:
  ;;
  ;; Emacs27 introduces early-init.el, which is run before init.el,
  ;; before package and UI initialization happens.
  ;;
  ;; ---
  ;;
  ;; This program is free software: you can redistribute it and/or modify
  ;; it under the terms of the GNU General Public License as published by
  ;; the Free Software Foundation, either version 3 of the License, or (at
  ;; your option) any later version.
  ;;
  ;; This program is distributed in the hope that it will be useful, but
  ;; WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  ;; General Public License for more details.
  ;;
  ;; You should have received a copy of the GNU General Public License
  ;; along with GNU Emacs.  If not, see <https://www.gnu.org/licenses/>.
  ;;
  ;; ---
  ;;
    ;;; Code:

  

  (unless (daemonp)
    (advice-add #'display-startup-echo-area-message :override #'ignore))

  (setq
   package-enable-at-startup nil ; don't auto-initialize!
   package--init-file-ensured t ; don't add that `custom-set-variables' block to init
   package-quickstart nil ; prevent `package.el' loading packages prior to their init-file
   package-archives nil)

  (setq gc-cons-threshold (expt 2 32)) ; you can remove it

  ;; Defer garbage collection further back in the startup process
  (setq gc-cons-threshold most-positive-fixnum ; 2^61 bytes
        gc-cons-percentage 0.6)

  (add-hook 'emacs-startup-hook
            (lambda ()
              (setq gc-cons-threshold 16777216 ; 16mb
                    gc-cons-percentage 0.1)))

  (setq safe-local-variable-values
        '((org-src-preserve-indentation . t)
          (eval add-hook 'after-save-hook
                '(lambda nil
                   (org-babel-tangle))
                nil t)))

  (setq
   use-file-dialog nil
   mode-line-format nil ; don't want a mode line while loading init
   load-prefer-newer nil
   create-lockfiles nil ; disable lockfiles
   make-backup-files nil ; disable backup files
   auto-save-list-file-prefix nil ; disable auto-save
   auto-mode-case-fold nil ; use case-sensitive `auto-mode-alist' for performance
   default-input-method nil
   utf-translate-cjk-mode nil ; disable CJK coding/encoding (Chinese/Japanese/Korean characters)
   initial-scratch-message nil ; empty the initial *scratch* buffer.
   command-line-x-option-alist nil ; remove irreleant command line options for faster startup
   vc-follow-symlinks t ; Do not ask about symlink following
   inhibit-default-init t
   inhibit-splash-screen t
   inhibit-startup-screen t 		; do not show the startup message
   inhibit-startup-message t      ; reduce noise at startup
   inhibit-startup-buffer-menu t  ; stop `list-buffers' from showing when opening multiple files
   fast-but-imprecise-scrolling t ; more performant rapid scrolling over unfontified regions
   frame-inhibit-implied-resize t ; do not resize the frame at this early stage
   use-short-answers t
   ffap-machine-p-known 'reject   ; don't ping things that look like domain names
   inhibit-compacting-font-caches t ; Inhibit frame resizing for performance
   read-process-output-max (* 1024 1024) ; Increase how much is read from processes in a single chunk.
   redisplay-skip-fontification-on-input t ; Inhibits it for better scrolling performance.
   idle-update-delay 1.0 ; slow down UI updates down
   select-active-regions 'only ; Emacs hangs when large selections contain mixed line endings
   ad-redefinition-action 'accept ; disable warnings from legacy advice system
   initial-major-mode 'fundamental-mode
   inhibit-startup-echo-area-message user-login-name)

  ;; Maximize the Emacs frame on startup
  (push '(fullscreen . maximized) initial-frame-alist)
  (push '(fullscreen . maximized) default-frame-alist)

  ;; Prevent the glimpse of un-styled Emacs by disabling these UI elements early.
  (push '(menu-bar-lines . 0) default-frame-alist)
  (push '(tool-bar-lines . 0) default-frame-alist)
  (push '(vertical-scroll-bars) default-frame-alist)

  ;; Suppress warnings and errors during asynchronous native compilation
  (setq native-comp-async-report-warnings-errors nil)
  (setq native-comp-jit-compilation nil)

  (provide 'early-init)
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;;; early-init.el ends here
    #+end_src

* 🔰 Start-ify
Manage Font size, Initialize Package setup and sends you startup time (Daemonize 👹 your Emacs)
#+begin_src emacs-lisp
  ;;; init.el --- Initialization file -*- lexical-binding: t; -*-
  ;;
  ;; Filename: init.el
  ;; Description: Initialize Emacs (The GOAT-Editor)
  ;; Author: Dilip
  ;; Copyright © 2023 Dilip
  ;; Version: 0.7
  ;; URL: https://github.com/idlip/d-nix
  ;; Keywords: init emacs
  ;; Compatibility: emacs-version >= 29.1
  ;;
  ;; ---
  ;;
  ;;; Commentary:
  ;;
  ;; This is the init.el file for Pgtk Emacs (wayland)
  ;;
  ;; ---
  ;;
  ;; This program is free software: you can redistribute it and/or modify
  ;; it under the terms of the GNU General Public License as published by
  ;; the Free Software Foundation, either version 3 of the License, or (at
  ;; your option) any later version.
  ;;
  ;; This program is distributed in the hope that it will be useful, but
  ;; WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  ;; General Public License for more details.
  ;;
  ;; You should have received a copy of the GNU General Public License
  ;; along with GNU Emacs.  If not, see <https://www.gnu.org/licenses/>.
  ;;
  ;; ---
  ;;
  ;;; Code:

  
  ;; BetterGC
  (defvar better-gc-cons-threshold 134217728 ; 128mb
    "If you experience freezing, decrease this.
  If you experience stuttering, increase this.")

  (add-hook 'emacs-startup-hook
            (lambda ()
              (setq gc-cons-threshold better-gc-cons-threshold)
              (makunbound 'file-name-handler-alist-original)))
  ;; -BetterGC

  ;; AutoGC
  (add-hook 'emacs-startup-hook
            (lambda ()
              (if (boundp 'after-focus-change-function)
                  (add-function :after after-focus-change-function
                                (lambda ()
                                  (unless (frame-focus-state)
                                    (garbage-collect))))
                (add-hook 'after-focus-change-function 'garbage-collect))
              (defun gc-minibuffer-setup-hook ()
                (setq gc-cons-threshold (* better-gc-cons-threshold 2)))

              (defun gc-minibuffer-exit-hook ()
                (garbage-collect)
                (setq gc-cons-threshold better-gc-cons-threshold))

              (add-hook 'minibuffer-setup-hook #'gc-minibuffer-setup-hook)
              (add-hook 'minibuffer-exit-hook #'gc-minibuffer-exit-hook)))
  ;; -AutoGC

  ;; Initialize package sources
  (require 'package)

  (setq package-user-dir (expand-file-name "elpa" user-emacs-directory)
        package-archives
        '(("melpa" . "https://melpa.org/packages/")
          ("org" . "https://orgmode.org/elpa/")
          ("elpa" . "https://elpa.gnu.org/packages/"))
        package-quickstart nil)

  (setq package-archive-priorities
        '(("melpa" .  3)
          ("org" . 2)
          ("elpa" . 1)))

  (unless (bound-and-true-p package--initialized)
    (setq package-enable-at-startup nil) ; To prevent initializing twice
    (package-initialize))

  (unless package-archive-contents
    (package-refresh-contents))

  ;; Initialize use-package on non-Linux platforms
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (eval-and-compile
    (setq use-package-verbose (not (bound-and-true-p byte-compile-current-file))))

  (require 'use-package)
  (use-package use-package
    :custom
    (use-package-verbose t)
    (use-package-always-ensure t)  ; :ensure t by default
    (use-package-always-defer nil) ; :defer t by default
    (use-package-expand-minimally t)
    (use-package-enable-imenu-support t))

  #+end_src

