d-emacs.org
* 🔤 Fontify
Fonts are crucial to read.
#+begin_src emacs-lisp
    ;; You will most likely need to adjust this font size for your system!

    (defvar default-font-size 170)
    (defvar default-variable-font-size 170)

    ;; Set reusable font name variables
    (defvar d/fixed-width-font "ComicCodeLigatures Nerd Font"
      "The font to use for monospaced (fixed width) text.")

    (defvar d/variable-width-font "ComicCodeLigatures Nerd Font"
      "The font to use for variable-pitch (documents) text.")

    (setq haki-heading-font "Comic Mono")
    (setq haki-sans-font "Iosevka Comfy Motion")
  ;;  (setq haki-code-font "JetBrainsMono Nerd Font")
    (setq haki-title-font "Impress BT")
    (setq haki-link-font "VictorMono Nerd Font")
    (setq haki-code-font "Maple Mono NF")



    (setf use-default-font-for-symbols nil)
    (set-fontset-font t 'unicode "Noto Emoji" nil 'append)

    (defun d/set-font-faces ()
      (message "Setting faces!")
      (set-face-attribute 'default nil :family d/variable-width-font :weight 'medium :height default-font-size)

      ;; Set the fixed pitch face (monospace)
      (set-face-attribute 'fixed-pitch nil :family d/fixed-width-font :height default-font-size)

      ;; Set the variable pitch face (document text)
      (set-face-attribute 'variable-pitch nil :family d/variable-width-font :height default-variable-font-size :weight 'medium)
      (global-font-lock-mode 1)
      (setq font-lock-maximum-decoration t))
#+end_src

* 📑 Cleanliness
Keep folders and backuping files clean!
#+begin_src emacs-lisp
  (use-package no-littering               ; Keep .emacs.d clean
    :custom
    (no-littering-var-directory (expand-file-name "data/" user-emacs-directory))
    (no-littering-etc-directory (expand-file-name "config/" user-emacs-directory))
    :config
    (require 'recentf)
    (add-to-list 'recentf-exclude no-littering-var-directory)
    (add-to-list 'recentf-exclude no-littering-etc-directory)

    ;; Move this in its own thing
    (setq
     create-lockfiles nil
     delete-old-versions t
     kept-new-versions 6
     kept-old-versions 2
     version-control t)

    (setq
     backup-directory-alist
     `((".*" . ,(no-littering-expand-var-file-name "backup/")))
     auto-save-file-name-transforms
     `((".*" ,(no-littering-expand-var-file-name "auto-save/") t))))

  (use-package gcmh
    :init (gcmh-mode 1)
    :config
    (setq
     gcmh-idle-delay 'auto ; default is 15s
     gcmh-auto-idle-delay-factor 10
     gcmh-high-cons-threshold (* 16 1024 1024)) ; 16mb
    :delight " Ⓖ")

  (use-package savehist
    :init
    (savehist-mode)
    :custom
    (setq savehist-additional-variables '(kill-ring search-ring regexp-search-ring)))
#+end_src

* ⌨️ Better Bindings
** Custom functions
#+begin_src emacs-lisp
  (defun split-and-follow-horizontally ()
    "Basically to balance and change cursor to split window"
    (interactive)
    (split-window-below)
    (balance-windows)
    (other-window 1))

  (defun split-and-follow-vertically ()
    "Basically to balance and change cursor to split window"
    (interactive)
    (split-window-right)
    (balance-windows)
    (other-window 1))

  (defun d/refresh-buffer ()
    "Revert buffer without confirmation."
    (interactive)
    (revert-buffer :ignore-auto :noconfirm))

  (defun window-focus-mode ()
    "Make the window focused, it can toggled in and out"
    (interactive)
    (if (= 1 (length (window-list)))
        (jump-to-register '_)
      (progn
        (set-register '_ (list (current-window-configuration)))
        (delete-other-windows))))

  (defun d/edit-src-block ()
    "Makes editing src block focused in its respective major mode"
    (interactive)
    (if (org-src-edit-buffer-p)         (org-edit-src-abort)
    (progn (org-edit-special) (window-focus-mode))))

  (defun d/insert-unicodes (add-unicodes)
    "Inserts unicode character (emoji/icons) from given files"
    (interactive (list add-unicodes))
    (insert
     (let* ((content
             (mapcar #'(lambda (file) (with-temp-buffer (insert-file-contents file) (split-string (buffer-string) "\n" t))) add-unicodes))
            (options (apply #'append content))
            (selected-item (completing-read "Choose Icon 󰨈: " options))
            (fields (split-string selected-item)))
       (car fields))))
  (setq add-unicodes (directory-files "~/d-git/d-bin/treasure/unicodes/" t "i"))

  (defun org-archive-done-tasks ()
    (interactive)
    (org-map-entries
     (lambda ()
       (org-archive-subtree)
       (setq org-map-continue-from (org-element-property :begin (org-element-at-point))))
     "/DONE" 'tree))

        #+end_src
** Respected binds
#+begin_src emacs-lisp
  (dolist (keybind '(("M-o" . other-window)

                     ;; Better scrolling (emacs 29)
                     ("M-v" . d/scroll-up)
                     ("C-v" . d/scroll-down)
                     ;; refresh/re-read buffer
                     ("<f5>" . d/refresh-buffer)
                     ;; insert color or nerd icons
                     ("C-c d i" . d/insert-unicodes)
                     ("C-c d c" . d/insert-colors)
                     ;; better splits
                     ("C-x 2" . split-and-follow-horizontally)
                     ("C-x 3" . split-and-follow-vertically)
                     ;; regex replace
                     ("M-%" . query-replace-regexp)
                     ;; quick kill
                     ("C-x C-k" . d/kill-buffer)
                     ("C-x k" . kill-buffer)
                     ("<escape>" . keyboard-escape-quit)
                     ;; handy editing
                     ("M-z" . zap-up-to-char)
                     ("M-u" . upcase-dwim)
                     ("M-l" . downcase-dwim)
                     ("M-c" . capitalize-dwim)))
    (global-set-key (kbd (car keybind)) (cdr keybind)))

  ;; Get rid of annoyance
  (global-unset-key (kbd "C-x C-z"))
  (global-unset-key (kbd "C-z"))

#+end_src
* 🎹 What Key?
Many people know that emacs has lot of keychords, which aren't easy to remember, ~which-key~ is a package which shows cheatsheet for the keychords you press. Mostly will find helpful for ~C-x~ or ~C-c~ or (yours general key/leader key)
#+begin_src emacs-lisp
  (use-package which-key
    :defer 0
    :init
    (setq which-key-side-window-location 'bottom
          which-key-sort-order #'which-key-key-order-alpha
          which-key-sort-uppercase-first nil
          which-key-add-column-padding 1
          which-key-max-display-columns nil
          which-key-min-display-lines 6
          which-key-side-window-slot -10
          which-key-side-window-max-height 0.25
          which-key-idle-delay 0.8
          which-key-max-description-length 25
          which-key-allow-imprecise-window-fit t
          which-key-separator " → " )
    :diminish which-key-mode
    :config
    (which-key-mode)
    (setq which-key-idle-delay 1))

#+end_src

* 🍁 Helpful
Helpful package to even elaborate on describe commands. Decreases many hassles.

#+begin_src emacs-lisp
  (use-package helpful
    :hook (helpful-mode . hide-mode-line-mode)
    :bind
    ("C-h f" . helpful-callable)
    ("C-h v" . helpful-variable)
    ("C-h k" . helpful-key)
    ("C-h x" . helpful-command)
    ("C-c C-d" . helpful-at-point)
    ("C-h F" . helpful-function)
    (:map helpful-mode-map
          ("q" . kill-buffer-and-window)))

#+end_src

* 🎨 Color-ify
Coloured parentheses or hex values are really needed for some usecases, obviously you know it lol.
*Happy Ricing* but use Emacs Everywhere lol
#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :defer t
    :hook (prog-mode . rainbow-delimiters-mode))
  (use-package rainbow-mode
    :defer t
    :hook (prog-mode . rainbow-mode)
    :bind ("C-c t c" . rainbow-mode))
#+end_src
* 🖱️ Good Mouse use?
Just don't use mouse, try to stay with keyboard, feel like *Pro*!
But if you like clicks, tacks and ticks of you mouse, then go with it. (Mouse is a good invention lol)
#+begin_src emacs-lisp
  (setq scroll-conservatively 101) ;; value greater than 100 gets rid of half page jumping
  (setq mouse-wheel-scroll-amount nil)
  (setq mouse-wheel-progressive-speed t) ;; accelerate scrolling
  (setq mouse-wheel-follow-mouse 't) ;; scroll window under mouse
#+end_src

* 😇 Minad - The Messiah
[[https://github.com/minad][@minad]] is a great guy, It is one of the reason why I love Emacs and Moved here, and use it everywhere as much as Possible.
Just see his git repo issues, he has it all solved, and he will explain and converse with clear and good explanation, I wondered how could a man be so dedicated to Emacs so well with very positive approach. Consider trying his packages and if possible, do Donate to him.
Just Awesome, if it wasn't for his packages, I probably would never have tried Emacs. Now I hate vim/neovim, Idk why.

