d-emacs.org
** ❤️ Vertico - The first
Just check the [[https://github.com/minad/vertico][Vertico github]] repo, you will find great Readme file with rich information and some basic usage codes which is more than enough.
#+begin_src emacs-lisp
  (use-package vertico
    :bind (:map vertico-map
                ("?" . minibuffer-completion-help)
                ("RET" . vertico-directory-enter)
                ("DEL" . vertico-directory-delete-char)
                ("M-d" . vertico-directory-delete-char)
                ("M-DEL" . vertico-directory-delete-word)
                ("C-j" . vertico-next)
                ("C-k" . vertico-previous)
                ("M-j" . vertico-quick-exit)
                ("'" . vertico-quick-exit)
                ("C-v" . vertico-scroll-up)
                ("M-v" . vertico-scroll-down)
                ("M-q" . d/vertico-toggle)
                ("M-RET" . minibuffer-force-complete-and-exit)
                ("M-TAB" . minibuffer-complete))

    :init
    (vertico-mode)
    (setq vertico-scroll-margin 5)
    (setq vertico-count 10)
    (setq vertico-resize t)
    (setq vertico-cycle t)
    :config
    (setq vertico-buffer-display-action '(display-buffer-in-direction
                                          (direction . right)
                                          (window-width . 0.45)))
    (setq vertico-multiform-categories
        '((file )
          (consult-location buffer)
          (t unobtrusive)))
    (setq vertico-multiform-commands
          '((consult-ripgrep buffer))))

  (defun d/vertico-toggle ()
    "Toggle between vertico-unobtrusive and vertico-mode."
    (interactive)
    (vertico-multiform-vertical 'vertico-unobtrusive-mode))

  (use-package emacs
    :init
    (defun crm-indicator (args)
      (cons (format "[CRM%s] %s"
                    (replace-regexp-in-string
                     "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
                     crm-separator)
                    (car args))
            (cdr args)))
    (advice-add #'completing-read-multiple :filter-args #'crm-indicator)

    ;; Do not allow the cursor in the minibuffer prompt
    (setq minibuffer-prompt-properties
          '(read-only t cursor-intangible t face minibuffer-prompt))
    (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

    (setq completion-cycle-threshold 3)
    (setq tab-always-indent t)
    (setq enable-recursive-minibuffers t))

#+end_src
