d-emacs.org
*** Custom templates
Making snippets/templates is so easy with this package.
#+begin_src emacs-lisp :tangle ~/.config/emacs/templates
  ;; Refer: `tempo-define-template' for doc.
  ;;  • (s NAME) Inserts a named field.
  ;;  • (p/r PROMPT <NAME> <NOINSERT>) Insert an optionally named field with a prompt. The PROMPT is
  ;;  displayed directly in the buffer as default value. If NOINSERT is non-nil, no field is inserted.
  ;;  Then the minibuffer is used for prompting and the value is bound to NAME.

  nix-mode

  (gitpackage "{ lib" n ", stdenv" n ", fetchFromGitHub" n ", " (p "inputs") n ", " (p "inputs") n "}:" n n>
              "stdenv.mkDerivation rec {" n> "pname = \"" (p "" pkgn nil) "\";" n> "version = \"" p "\";" n n>
              "src = fetchFromGitHub {" n> "owner = \"" (p "" own) "\";" n> "repo = \"" (s pkgn) "\";" n>
              "rev = \"" "v${version}" "\";" n> "sha256 = \"" "${lib.fakeSha256}" "\";" n> "};" n n>
              "nativeBuildInputs = [ " (p "makeWrapper") " ];" n n> "BuildInputs = [ " (p) " ];" n n>
              "meta = with lib; {" n>
              "homepage = \"" "https://github.com/" (s own) "/" (s pkgn) "\";" n>
              "description = \"" (p) "\";" n>
              "license = licenses." (p (completing-read "License: " '("agpl3" "asl20" "bsd1" "bsd2" "bsd3" "free" "gpl2" "gpl2Only" "gpl2Plus" "gpl3" "gpl3Only" "gpl3Plus" "isc" "lgpl21Only" "lgpl21Plus" "lgpl2Only" "lgpl2Plus" "lgpl3" "lgpl3Only" "mit" "mpl20" "ofl" "unfree"))) ";" n>
              "maintainers = with maintainers; [ " (s own) " ];" n>
              "platforms = platforms." 
              (p (completing-read "Platform: " '("all" "allBut" "arm" "cygwin" "darwin" "freebsd" "gnu" "i686" "illumos" "linux" "mesaPlatforms" "mips" "netbsd" "none" "openbsd" "unix" "x86"))) ";" n> q "};" n> "}"
  )

  org-mode

  (hugosite ":PROPERTIES:"  n ":EXPORT_FILE_NAME: " (p "simple-name") n ":EXPORT_DATE: " (format-time-string "%Y-%m-%d") n ":EXPORT_HUGO_DRAFT: false" n ":END:")
  (readonly ":tangle-mode (identity #o444) :mkdirp yes" n)
  (variablweb "#+name: " (p "noweb-ref") n "#+begin_src " p n> r> n> "#+end_src" :post (org-edit-src-code))
  (datime (format-time-string "%Y-%m-%d %A %d %B %Y"))
  (gitcollapse  "*** " p n "#+begin_html" n "<details>" n "<summary> " (p "heading")  " </summary>" n "#+end_html" n (p "link or any comments") n n "#+begin_html" n "</details>" n "#+end_html" n n)

  markdown-mode

  (gitcollapse "## " (p "Heading") n n "<details>" n n
               "<summary>" (p "Sub Heading")  "</summary>" n n
               (r "Insert Link or comments") n n "</details>")
  (bolditalics "***" p "***")
  (srcblock (call-interactively #'markdown-insert-gfm-code-block))
  (src "'" p "'")
  (unorderlist "- " (p "First") n> "- " (p "Second") n> "- " (p "Third"))
  (orderlist "1. " (p "First") n> "2. " (p "Second") n> "3. " (p "Third"))
  (insertimage (call-interactively #'markdown-insert-image))
  (insertlink (call-interactively #'markdown-insert-link))
  (hugotitle "+++" n "title = " (p "title") n "date = " (format-time-string "%Y-%m-%d") n "tags = [ " (p "tag1, tag2 ") "]" n "draft = false" n "+++")
  (h1 "# " p " #")
  (h2 "## " p " ##")
  (h3 "### " p " ###")
  (h4 "#### " p " ####")
  (inserttable (call-interactively #'markdown-insert-table))

  nix-mode

  (buildphase > "buildPhase= ''" n (p "Build Instructions") n " '';")
  (checkPhase > "checkPhase= ''" n (p "") n " '';")
  (configurephase > "configurePhase= ''" n (p "") n " '';")
  (fixupphase > "fixupPhase= ''" n (p "") n " '';")
  (distphase > "distPhase= ''" n (p "") n " '';")
  (patchphase > "patchPhase= ''" n (p "") n " '';")
  (unpackphase > "unpackPhase= ''" n (p "") n " '';")
  (installCheckPhasephase > "installCheckPhasePhase= ''" n (p "") n " '';")
  (installphase > "installphase= ''" n p " mkdir -p $out/bin" n> "for f in $(find . -executable -type f);" n> "do" n> "cp $f $out/bin" n> "done}" n> " '';")


  ;; Local Variables:
  ;; mode: lisp-data
  ;; outline-regexp: "[a-z]"
  ;; End:

#+end_src
** Modernize - Organize
You will see org just below this, this package helps make Org-Mode looks eye-candy and how it reached average audience.
#+begin_src emacs-lisp
  (use-package org-modern
    :defer t)
  ;; (add-hook 'org-mode-hook #'org-modern-mode)
  (add-hook 'org-agenda-finalize-hook #'org-modern-agenda)

  ;; (set-face-attribute 'org-modern-symbol nil :family "Iosevka")

  ;; Add frame borders and window dividers
  (modify-all-frames-parameters
   '((right-divider-width . 1)
     (bottom-divider-width . 0)
     (internal-border-width . 5)))
  (dolist (face '(window-divider
                  window-divider-first-pixel
                  window-divider-last-pixel))
    (face-spec-reset-face face)
    (set-face-foreground face (face-attribute 'default :background)))
  (setq
   ;; Edit settings
   org-auto-align-tags nil
   org-tags-column 0
   org-catch-invisible-edits 'show-and-error
   org-special-ctrl-a/e t
   org-insert-heading-respect-content t

   ;; Org styling, hide markup etc.
   org-hide-emphasis-markers t
   org-pretty-entities t
   ;;   org-ellipsis "…"

   org-modern-star '("◉" "✤" "◈" "✿" "✤")
   org-modern-hide-stars 'leading
   org-modern-table t
   org-modern-list
   '((?* . "❉")
     (?- . "❖")
     (?+ . "➤"))

   ;; Agenda styling
   org-agenda-tags-column 0
   org-agenda-block-separator ?─
   org-agenda-time-grid
   '((daily today require-timed)
     (800 1000 1200 1400 1600 1800 2000)
     " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
   org-agenda-current-time-string
   "⭠ now ─────────────────────────────────────────────────")

  (global-org-modern-mode)

#+end_src
** Jinxed Correction
Jinx is another cool new package for spell corrections
#+begin_src emacs-lisp
  (use-package jinx
    :hook (emacs-startup . global-jinx-mode)
    :bind ("M-$". jinx-correct)
    :config
    (add-to-list 'vertico-multiform-categories
                 '(jinx grid indexed))
    (vertico-multiform-mode 1))
#+end_src

* 🗄️ Organize Life
Life's Good if you Organize is well, don't worry if you feel organizing is not easy, Org for the rescue.
Plain (naked) simple file can help maintain GTD, even hell lot more many people don't know about.
Don't compare Notion or Logseq, Org-mode is on different league. These no match for it yet ( actually from 20 years lol). If you know Org, you know it. If not, go check YT.
** Good Org
#+begin_src emacs-lisp
    (defun org-font-setup ()
      ;; Replace list hyphen with dot
      (font-lock-add-keywords 'org-mode
                              '(("^ *\\([-]\\) "
                                 (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

        (dolist (face '((org-block . 1.0)
                        (org-block-begin-line . 0.9)
                        (org-document-info . 1.5)
                        (org-document-title . 1.7)
                        (org-level-1 . 1.4)
                        (org-level-2 . 1.3)
                        (org-level-3 . 1.2)
                        (org-level-4 . 1.1)
                        (org-level-5 . 1.1)
                        (org-level-6 . 1.1)
                        (org-code . 1.2)
                        (header-line . 1.0)
                        (org-verbatim . 1.15)
                        (variable-pitch . 1.0)
                        (org-level-7 . 1.1)))
          (set-face-attribute (car face) nil :font d/fixed-width-font :weight 'medium :height (cdr face))))

      ;; Set faces for heading levels

        ;; (set-face-attribute (car face) nil :font d/header-font :weight 'regular :height (cdr face)))


    (defun org-mode-setup ()
      ;; (org-indent-mode 1)
      (org-display-inline-images 1)
      (variable-pitch-mode 1)
      ;; (org-font-setup)
      (setq
       org-startup-indented nil
       org-image-actual-width 300
       org-startup-folded t)
      )

    (use-package org
      :pin org
      :commands (org-capture org-agenda)
      :hook (org-mode . org-mode-setup)
      (org-mode . org-modern-mode)

      :bind (("C-c c c" . org-capture)
             ("C-c c d" . calendar)
             ("C-c t R" . d/bionic-region)
             ("C-c d a" . org-agenda)
             ("C-c t r" . d/bionic-read)
             ("<f6>" . d/edit-src-block)
             :map org-mode-map
             ("C-c o b" . d/edit-src-block))
      :config
      (setq org-ellipsis " ▾")

      (setq org-agenda-start-with-log-mode t)
      ;; (setq org-log-done 'time)
      (setq org-log-done 'note)
      (setq org-log-into-drawer t)

      ;; browser script
      (setq browse-url-browser-function 'browse-url-generic
            browse-url-generic-program "d-stuff")
      (setq browse-url-secondary-browser-function 'browse-url-generic
            browse-url-generic-program "d-stuff")

      (setq org-agenda-files
            '("~/sync/org/tasks.org"
              "~/d-git/d-site/README.org"))

      ;; (require 'org-habit)
      ;; (add-to-list 'org-modules 'org-habit)
      ;; (setq org-habit-graph-column 60)

      (setq org-todo-keywords
            '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
              (sequence  "PLAN(p)" "REVIEW(v)" "|" "COMPLETED(c)" "CANC(k@)")))

      (setq org-refile-targets
            '(("Archive.org" :maxlevel . 1)
              ("tasks.org" :maxlevel . 1)))

      ;; Save Org buffers after refiling!
      (advice-add 'org-refile :after 'org-save-all-org-buffers)

      (setq org-tag-alist
            '((:startgroup)
              (:endgroup)
              ("@work" . ?W)
              ("agenda" . ?a)
              ("linux" . ?l)
              ("planning" . ?p)
              ("note" . ?n)
              ("idea" . ?i)))


      (setq org-capture-templates
            `(
              ("t" "Task" entry (file+olp "~/sync/org/tasks.org" "One-Timer")
               "* TODO %?\n  SCHEDULED:%U\n  %a\n  %i" :empty-lines 1)
              ("w" "Website Todo" entry (file+headline "~/d-git/d-site/README.org" "Ideas - TODO")
               "* TODO %?\n  SCHEDULED:%T\n " :empty-lines 1)

              ("j" "Journal Entries")
              ("jj" "Journal" entry
               (file+olp+datetree "~/docs/org/journal.org")
               "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
               ;; ,(dw/read-file-as-string "~/Notes/Templates/Daily.org")
               :clock-in :clock-resume
               :empty-lines 1))))


           #+end_src
