gdk/i-home/configs/emacs/init.el

(use-package org-modern
  :defer t)
;; (add-hook 'org-mode-hook #'org-modern-mode)
(add-hook 'org-agenda-finalize-hook #'org-modern-agenda)

;; (set-face-attribute 'org-modern-symbol nil :family "Iosevka")

;; Add frame borders and window dividers
(modify-all-frames-parameters
 '((right-divider-width . 1)
   (bottom-divider-width . 0)
   (internal-border-width . 5)))
(dolist (face '(window-divider
                window-divider-first-pixel
                window-divider-last-pixel))
  (face-spec-reset-face face)
  (set-face-foreground face (face-attribute 'default :background)))
(setq
 ;; Edit settings
 org-auto-align-tags nil
 org-tags-column 0
 org-catch-invisible-edits 'show-and-error
 org-special-ctrl-a/e t
 org-insert-heading-respect-content t

 ;; Org styling, hide markup etc.
 org-hide-emphasis-markers t
 org-pretty-entities t
 ;;   org-ellipsis "…"

 org-modern-star '("◉" "✤" "◈" "✿" "✤")
 org-modern-hide-stars 'leading
 org-modern-table t
 org-modern-list
 '((?* . "❉")
   (?- . "❖")
   (?+ . "➤"))

 ;; Agenda styling
 org-agenda-tags-column 0
 org-agenda-block-separator ?─
 org-agenda-time-grid
 '((daily today require-timed)
   (800 1000 1200 1400 1600 1800 2000)
   " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
 org-agenda-current-time-string
 "⭠ now ─────────────────────────────────────────────────")

(global-org-modern-mode)

(use-package jinx
  :hook (emacs-startup . global-jinx-mode)
  :bind ("M-$". jinx-correct))

(defun org-font-setup ()
  ;; Replace list hyphen with dot
  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

    (dolist (face '((org-block . 1.0)
                    (org-block-begin-line . 0.9)
                    (org-document-info . 1.5)
                    (org-document-title . 1.7)
                    (org-level-1 . 1.4)
                    (org-level-2 . 1.3)
                    (org-level-3 . 1.2)
                    (org-level-4 . 1.1)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-code . 1.2)
                    (header-line . 1.0)
                    (org-verbatim . 1.15)
                    (variable-pitch . 1.0)
                    (org-level-7 . 1.1)))
      (set-face-attribute (car face) nil :font d/fixed-width-font :weight 'medium :height (cdr face))))

  ;; Set faces for heading levels

    ;; (set-face-attribute (car face) nil :font d/header-font :weight 'regular :height (cdr face)))


(defun org-mode-setup ()
  ;; (org-indent-mode 1)
  (org-display-inline-images 1)
  (variable-pitch-mode 1)
  ;; (org-font-setup)
  (setq
   org-startup-indented nil
   org-image-actual-width 300
   org-startup-folded t)
  )

(use-package org
  :pin org
  :commands (org-capture org-agenda)
  :hook (org-mode . org-mode-setup)
  (org-mode . org-modern-mode)

  :bind (("C-c c c" . org-capture)
         ("C-c c d" . calendar)
         ("C-c t R" . d/bionic-region)
         ("C-c d a" . org-agenda)
         ("C-c t r" . d/bionic-read)
         ("<f6>" . d/edit-src-block)
         :map org-mode-map
         ("C-c o b" . d/edit-src-block))
  :config
  (setq org-ellipsis " ▾")

  (setq org-agenda-start-with-log-mode t)
  ;; (setq org-log-done 'time)
  (setq org-log-done 'note)
  (setq org-log-into-drawer t)

  ;; browser script
  (setq browse-url-browser-function 'browse-url-generic
        browse-url-generic-program "d-stuff")
  (setq browse-url-secondary-browser-function 'browse-url-generic
        browse-url-generic-program "d-stuff")

  (setq org-agenda-files
        '("~/sync/org/tasks.org"
          "~/d-git/d-site/README.org"))

  ;; (require 'org-habit)
  ;; (add-to-list 'org-modules 'org-habit)
  ;; (setq org-habit-graph-column 60)

  (setq org-todo-keywords
        '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
          (sequence  "PLAN(p)" "REVIEW(v)" "|" "COMPLETED(c)" "CANC(k@)")))

  (setq org-refile-targets
        '(("Archive.org" :maxlevel . 1)
          ("tasks.org" :maxlevel . 1)))

  ;; Save Org buffers after refiling!
  (advice-add 'org-refile :after 'org-save-all-org-buffers)

  (setq org-tag-alist
        '((:startgroup)
          (:endgroup)
          ("@work" . ?W)
          ("agenda" . ?a)
          ("linux" . ?l)
          ("planning" . ?p)
          ("note" . ?n)
          ("idea" . ?i)))


  (setq org-capture-templates
        `(
          ("t" "Task" entry (file+olp "~/sync/org/tasks.org" "One-Timer")
           "* TODO %?\n  SCHEDULED:%U\n  %a\n  %i" :empty-lines 1)
          ("w" "Website Todo" entry (file+headline "~/d-git/d-site/README.org" "Ideas - TODO")
           "* TODO %?\n  SCHEDULED:%T\n " :empty-lines 1)

          ("j" "Journal Entries")
          ("jj" "Journal" entry
           (file+olp+datetree "~/docs/org/journal.org")
           "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
           ;; ,(dw/read-file-as-string "~/Notes/Templates/Daily.org")
           :clock-in :clock-resume
           :empty-lines 1))))

(with-eval-after-load 'org
