gdk/i-home/configs/emacs/init.el

(use-package denote
  :hook ((find-file-hook . denote-link-buttonize-buffer)

         (dired-mode . denote-dired-mode))
  :bind
  ("C-c n j" . d/my-journal)
  ("C-c n n" . denote)
  ("C-c n N" . denote-type)
  ("C-c n d" . denote-date)
  ("C-c n s" . denote-subdirectory)
  ("C-c n t" . denote-template)
  ("C-c n i" . denote-link)
  ("C-c n I" . denote-link-add-links)
  ("C-c n b" . denote-link-backlinks)
  ("C-c n f f" . denote-link-find-file)
  ("C-c n f b" . denote-link-find-backlink)
  ("C-c n r" . denote-rename-file)
  ("C-c n R" . denote-rename-file-using-front-matter)
  (:map dired-mode-map
        ("C-c C-d C-i" . denote-link-dired-marked-notes)
        ("C-c C-d C-r" . denote-dired-rename-marked-files)
        ("C-c C-d C-R" . denote-dired-rename-marked-files-using-front-matter))

  :config
  (setq
   denote-directory (expand-file-name "~/sync/denote")
   denote-known-keywords '("emacs" "blogs" "article")
   denote-infer-keywords t
   denote-sort-keywords t
   denote-file-type nil ; Org is the default, set others here
   denote-prompts '(title keywords)
   denote-excluded-directories-regexp nil
   denote-excluded-keywords-regexp nil
   denote-date-prompt-use-org-read-date t
   denote-allow-multi-word-keywords t
   denote-date-format nil
   denote-backlinks-show-context t)
  denote-dired-directories
  (list denote-directory
        (thread-last denote-directory (expand-file-name "attachments"))
        (expand-file-name "~/sync/org/books/")))

(defun d/my-journal ()
  (interactive)
  (let* ((date (org-read-date))
         (time (org-time-string-to-time date))
         (title (format-time-string "%A %d %B %Y" time))
         (initial (denote-sluggify title))
         (target (read-file-name "Select note: " (denote-directory) nil nil initial
                                 (lambda (f)
                                   (or (denote-file-has-identifier-p f)
                                       (file-directory-p f))))))
    (if (file-exists-p target)
        (find-file target)
      (denote title '("journal") denote-file-type nil date))))


(with-eval-after-load 'org-capture
  (setq denote-org-capture-specifiers "%l\n%i\n%?")
  (add-to-list 'org-capture-templates
               '("n" "New note (with denote.el)" plain
                 (file denote-last-path)
                 #'denote-org-capture
                 :no-save t
                 :immediate-finish nil
                 :kill-buffer t
                 :jump-to-captured t)))

(use-package olivetti
  :defer t
  :hook ((text-mode         . olivetti-mode)
         ;; (prog-mode         . olivetti-mode)
         (Info-mode         . olivetti-mode)
         (eshell-mode         . olivetti-mode)
         (helpful-mode         . olivetti-mode)
         (Info-mode         . olivetti-mode)
         (org-mode          . olivetti-mode)
         (ement-room-mode   . olivetti-mode)
         (dashboard-mode    . olivetti-mode)
         (eww-mode          . olivetti-mode)
         (sdcv-mode         . olivetti-mode)
         (fundamental-mode  . olivetti-mode)
         (nov-mode          . olivetti-mode)
         (markdown-mode     . olivetti-mode)
         (mu4e-view-mode    . olivetti-mode)
         (elfeed-show-mode  . olivetti-mode)
         (mu4e-compose-mode . olivetti-mode))
  :custom
  (olivetti-body-width 0.8)
  :delight " ⊛")

(use-package doom-modeline
  :init (doom-modeline-mode 1)
  (setq doom-modeline-time-icon nil)
  (setq doom-modeline-bar-width 7)
  (setq doom-modeline-major-mode-icon t)
  (setq inhibit-compacting-font-caches t)
  :custom ((doom-modeline-height 30)
           (doom-modeline-buffer-encoding nil)))

;; to hide during presentation and writing
(use-package hide-mode-line
  :bind
  ("<f9>" . hide-mode-line-mode))

(setq modus-themes-italic-constructs t
      modus-themes-bold-constructs t
      modus-themes-mixed-fonts t
      modus-themes-variable-pitch-ui t
      modus-themes-custom-auto-reload t
      modus-themes-disable-other-themes t
      modus-themes-prompts '(italic bold)
      modus-themes-org-blocks 'gray-background
      modus-themes-completions
      '((matches . (extrabold))
        (selection . (semibold italic text-also)))

      modus-themes-org-blocks 'gray-background

      modus-themes-headings
      '((1 . (variable-pitch 1.1))
        (2 . (1.1))
        (agenda-date . (1.2))
        (agenda-structure . (variable-pitch light 1.8))
        (t . (1.1))))

;; My own theme
(add-to-list 'custom-theme-load-path "~/.config/emacs/var/theme/")
(load-theme 'haki t)
(add-hook 'post-command-hook #'haki-meow-mode-line)
;; For foot to show colors properly
(add-to-list 'term-file-aliases '("foot" . "xterm"))

(setq-default scroll-conservatively 10000)
(setq-default scroll-margin 3)

(pixel-scroll-precision-mode t)

(defun d/scroll-down ()
  "Trust me, make scrolling alot smoother. +1 Makes you fall in love with Emacs again!"
  (interactive)
  (pixel-scroll-precision-scroll-down 20))

(defun d/scroll-up ()
  "Trust me, adds a wonderfull smooth scroll. You can do this by trackpad too (laptop)"
  (interactive)
  (pixel-scroll-precision-scroll-up 20))
