gdk/i-home/configs/emacs/init.el

(use-package nix-mode
    :mode "\\.nix\\'"
    :defer t)

  (add-hook 'prog-mode-hook #'display-line-numbers-mode)
  ;;(add-hook 'prog-mode-hook #'eglot-ensure)
  (add-hook 'prog-mode-hook #'flycheck-mode)

  (use-package markdown-mode
    :defer t
    :mode "\\.md\\'"
    :config
    (defun d/set-markdown-header-font-sizes ()
      (dolist (face '((markdown-header-face-1 . 1.3)
                      (markdown-header-face-2 . 1.2)
                      (markdown-header-face-3 . 1.15)
                      (markdown-header-face-4 . 1.1)
                      (markdown-header-face-5 . 1.0)))
        (set-face-attribute (car face) nil :weight 'normal :font d/header-font :height (cdr face))))

    (defun d/markdown-mode-hook ()
      (d/set-markdown-header-font-sizes))

    (add-hook 'markdown-mode-hook 'd/markdown-mode-hook))

  (use-package eglot
    :init
    (setq eglot-sync-connect 1
          eglot-connect-timeout 10
          eglot-autoshutdown t
          eglot-send-changes-idle-time 0.5
          ;; NOTE We disable eglot-auto-display-help-buffer because :select t in
          ;;      its popup rule causes eglot to steal focus too often.
          eglot-auto-display-help-buffer nil)
    :config
    (add-to-list 'eglot-server-programs '(nix-mode . ("nil")))
    (add-to-list 'eglot-server-programs '(bash-ts-mode . ("bash-language-server")))
    (add-to-list 'eglot-server-programs '(markdown-mode . ("marksman")))

    :hook
    (nix-mode . eglot-ensure)
    (bash-ts-mode . eglot-ensure)
    (markdown-mode-hook . eglot-ensure))

(defun my/eglot-capf ()
(setq-local completion-at-point-functions
            (list
             (cape-capf-buster
              (cape-super-capf
               #'eglot-completion-at-point
               #'cape-ispell
               #'cape-file
               #'cape-dabbrev) 'equal))))
(add-to-list 'completion-at-point-functions 
             (cape-capf-buster
              (cape-super-capf
               #'cape-file
               #'cape-dabbrev) 'equal))

(add-hook 'eglot-managed-mode-hook #'my/eglot-capf)
(setq-local completion-at-point-functions
            (list (cape-capf-buster #'my/eglot-capf 'equal)))

(use-package eglot-tempel
  :load-path "~/.config/emacs/elpa/eglot-tempel")

(use-package kind-icon
  :ensure t
  :after corfu
  :custom
  (kind-icon-default-face 'corfu-default) ; to compute blended backgrounds correctly
  :config
  (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter)
  (setq kind-icon-default-style '(:padding -0.5 :stroke 0 :margin 0 :radius 0 :height 0.6 :scale 1.0))
  (setq kind-icon-use-icons nil)
  (setq kind-icon-mapping
        `(
          (array ,(nerd-icons-codicon "nf-cod-symbol_array") :face font-lock-type-face)
          (boolean ,(nerd-icons-codicon "nf-cod-symbol_boolean") :face font-lock-builtin-face)
          (class ,(nerd-icons-codicon "nf-cod-symbol_class") :face font-lock-type-face)
          (color ,(nerd-icons-codicon "nf-cod-symbol_color") :face success)
          (command ,(nerd-icons-codicon "nf-cod-terminal") :face default)
          (constant ,(nerd-icons-codicon "nf-cod-symbol_constant") :face font-lock-constant-face)
          (constructor ,(nerd-icons-codicon "nf-cod-triangle_right") :face font-lock-function-name-face)
          (enummember ,(nerd-icons-codicon "nf-cod-symbol_enum_member") :face font-lock-builtin-face)
          (enum-member ,(nerd-icons-codicon "nf-cod-symbol_enum_member") :face font-lock-builtin-face)
          (enum ,(nerd-icons-codicon "nf-cod-symbol_enum") :face font-lock-builtin-face)
          (event ,(nerd-icons-codicon "nf-cod-symbol_event") :face font-lock-warning-face)
          (field ,(nerd-icons-codicon "nf-cod-symbol_field") :face font-lock-variable-name-face)
          (file ,(nerd-icons-codicon "nf-cod-symbol_file") :face font-lock-string-face)
          (folder ,(nerd-icons-codicon "nf-cod-folder") :face font-lock-doc-face)
          (interface ,(nerd-icons-codicon "nf-cod-symbol_interface") :face font-lock-type-face)
          (keyword ,(nerd-icons-codicon "nf-cod-symbol_keyword") :face font-lock-keyword-face)
          (macro ,(nerd-icons-codicon "nf-cod-symbol_misc") :face font-lock-keyword-face)
          (magic ,(nerd-icons-codicon "nf-cod-wand") :face font-lock-builtin-face)
          (method ,(nerd-icons-codicon "nf-cod-symbol_method") :face font-lock-function-name-face)
          (function ,(nerd-icons-codicon "nf-cod-symbol_method") :face font-lock-function-name-face)
          (module ,(nerd-icons-codicon "nf-cod-file_submodule") :face font-lock-preprocessor-face)
          (numeric ,(nerd-icons-codicon "nf-cod-symbol_numeric") :face font-lock-builtin-face)
          (operator ,(nerd-icons-codicon "nf-cod-symbol_operator") :face font-lock-comment-delimiter-face)
          (param ,(nerd-icons-codicon "nf-cod-symbol_parameter") :face default)
          (property ,(nerd-icons-codicon "nf-cod-symbol_property") :face font-lock-variable-name-face)
          (reference ,(nerd-icons-codicon "nf-cod-references") :face font-lock-variable-name-face)
          (snippet ,(nerd-icons-codicon "nf-cod-symbol_snippet") :face font-lock-string-face)
          (string ,(nerd-icons-codicon "nf-cod-symbol_string") :face font-lock-string-face)
          (struct ,(nerd-icons-codicon "nf-cod-symbol_structure") :face font-lock-variable-name-face)
          (text ,(nerd-icons-codicon "nf-cod-text_size") :face font-lock-doc-face)
          (typeparameter ,(nerd-icons-codicon "nf-cod-list_unordered") :face font-lock-type-face)
          (type-parameter ,(nerd-icons-codicon "nf-cod-list_unordered") :face font-lock-type-face)
          (unit ,(nerd-icons-codicon "nf-cod-symbol_ruler") :face font-lock-constant-face)
          (value ,(nerd-icons-codicon "nf-cod-symbol_field") :face font-lock-builtin-face)
          (variable ,(nerd-icons-codicon "nf-cod-symbol_variable") :face font-lock-variable-name-face)
          (t ,(nerd-icons-codicon "nf-cod-code") :face font-lock-warning-face))))

(use-package magit
  :defer t
  :config
  ;; Show word-granularity differences within diff hunks
  (setq magit-diff-refine-hunk t)
  :commands (magit-status magit-get-current-branch)
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))
