d-emacs.org
* 😸 Modal Meow
Meow, the most definite modal editing experience for Emacs. It is nice ;)
It is one of the package I wish I had soon discovered it.
#+begin_src emacs-lisp
  ;; We need to define setup for keyboard layout

  (require 'meow)

  (defun meow-setup ()
    (setq meow-cheatsheet-layout meow-cheatsheet-layout-qwerty)
    (setq meow-use-cursor-position-hack t)
    (meow-motion-overwrite-define-key
     '("j" . meow-next)
     '("k" . meow-prev)
     '("<escape>" . ignore))
    (meow-leader-define-key
     ;; SPC j/k will run the original command in MOTION state.
     '("j" . "H-j")
     '("k" . "H-k")
     ;; Use SPC (0-9) for digit arguments.
     '("1" . meow-digit-argument)
     '("2" . meow-digit-argument)
     '("3" . meow-digit-argument)
     '("4" . meow-digit-argument)
     '("5" . meow-digit-argument)
     '("6" . meow-digit-argument)
     '("7" . meow-digit-argument)
     '("8" . meow-digit-argument)
     '("9" . meow-digit-argument)
     '("0" . meow-digit-argument)
     '("/" . meow-keypad-describe-key)
     '("?" . meow-cheatsheet))
    (meow-normal-define-key
     '("0" . meow-expand-0)
     '("9" . meow-expand-9)
     '("8" . meow-expand-8)
     '("7" . meow-expand-7)
     '("6" . meow-expand-6)
     '("5" . meow-expand-5)
     '("4" . meow-expand-4)
     '("3" . meow-expand-3)
     '("2" . meow-expand-2)
     '("1" . meow-expand-1)
     '("-" . negative-argument)
     '(";" . meow-reverse)
     '("," . meow-inner-of-thing)
     '("." . meow-bounds-of-thing)
     '("[" . meow-beginning-of-thing)
     '("]" . meow-end-of-thing)
     '("a" . meow-append)
     '("A" . meow-open-below)
     '("b" . meow-back-word)
     '("B" . meow-back-symbol)
     '("c" . meow-change)
     '("d" . meow-delete)
     '("D" . meow-backward-delete)
     '("e" . meow-next-word)
     '("E" . meow-next-symbol)
     '("f" . meow-find)
     '("g" . meow-cancel-selection)
     '("G" . meow-grab)
     '("h" . meow-left)
     '("H" . meow-left-expand)
     '("i" . meow-insert)
     '("I" . meow-open-above)
     '("j" . meow-next)
     '("J" . meow-next-expand)
     '("k" . meow-prev)
     '("K" . meow-prev-expand)
     '("l" . meow-right)
     '("L" . meow-right-expand)
     '("m" . meow-join)
     '("n" . meow-search)
     '("o" . meow-block)
     '("O" . meow-to-block)
     '("p" . meow-yank)
     '("q" . meow-quit)
     '("Q" . meow-goto-line)
     '("r" . meow-replace)
     '("R" . meow-swap-grab)
     '("x" . meow-kill)
     '("t" . meow-till)
     '("u" . meow-undo)
     '("U" . meow-undo-in-selection)
     '("v" . meow-visit)
     '("w" . meow-mark-word)
     '("W" . meow-mark-symbol)
     '("s" . meow-line)
     '("X" . meow-goto-line)
     '("y" . meow-save)
     '("Y" . meow-sync-grab)
     '("z" . meow-pop-selection)
     '("'" . repeat)
     '("<escape>" . ignore)))

  (setq meow-replace-state-name-list
        '((normal . "")
          (motion . "")
          (keypad . "")
          (insert . "")
          (beacon . "")))

  ;meow-thing-register THING INNER BOUNDS
  (meow-thing-register 'arrow '(pair ("<") (">")) '(pair ("<") (">")))
  (add-to-list 'meow-char-thing-table '(?a . arrow))

  (meow-setup)
  (meow-global-mode 1)
#+end_src
* 📂 File Manager
Not that intuitive to use as file manager, once you get a hand of emacs. You will thank for this.
#+begin_src emacs-lisp
  (use-package dired
    :init (dirvish-override-dired-mode)
    :ensure nil
    :commands (dired dired-jump)
    :bind (("C-x C-j" . dired-jump)
           ("C-c f f" . window-focus-mode)
           ("C-c f e" . (lambda () (interactive) (find-file (expand-file-name "~/d-git/d-nix/d-emacs.org"))))
           ("C-c f s" . (lambda () (interactive) (find-file (expand-file-name "~/d-git/d-nix/d-setup.org"))))
           ("C-c f m" . (lambda () (interactive) (find-file (expand-file-name "~/d-git/d-nix/README.org"))))
           ("C-x C-d" . dirvish))
    (:map dired-mode-map
          ("q" . kill-buffer-and-window)
          ("j" . dired-next-line)
          ("k" . dired-previous-line)
          ("l" . dired-find-file)
          ("h" . dired-up-directory)
          ("C-x C-k" . dirvish-quit)
          ("b" . d/external-browser))

    :custom ((dired-listing-switches "-agho --group-directories-first")))
  (setq dired-listing-switches "-alt --dired --group-directories-first -h -G")
  (add-hook 'dired-mode-hook 'dired-hide-details-mode)
  (add-hook 'dired-mode-hook (lambda () (dired-omit-mode)))

#+end_src
*  Terminal
Vterm to replace terminal emulator.
#+begin_src emacs-lisp
  (use-package vterm
    :bind
    (("C-c d t" . vterm)
     ("<f12>" . d/vt-toggle))
    (:map vterm-mode-map
          ("<f12>" . d/vt-toggle)
          ("<f9>" . hide-mode-line-mode)
          ("C-q" . vterm-send-next-key))
    :config
    (setq vterm-shell "/etc/profiles/per-user/i/bin/zsh")
    (defun d/vt-toggle ()
    "Minimal hack to toggle vterm."
    (interactive)
    (if (vterm--get-cursor-point)
        (delete-window)
      (progn (vterm-other-window) (if (package-installed-p 'hide-mode-line) (hide-mode-line-mode) nil) (shrink-window 7)))))



  ;; nixos issue for loading mu4e
  ;; (add-to-list 'load-path "/etc/profiles/per-user/i/share/emacs/site-lisp/mu4e/")
#+end_src
* 🧊 Cool Stuffs
Some small codes from good source.
#+begin_src emacs-lisp
  (use-package reddigg
    :defer t
    :bind (("C-c d f" . reddigg-view-frontpage)
           ("C-c d r" . reddigg-view-sub))
    :config
    (setq org-confirm-elisp-link-function nil)
    (setq reddigg-subs '(bangalore india emacs fossdroid piracy aww)))

  (use-package hnreader
    :defer t)

  ;; (use-package howdoyou)
  ;; (use-package undo-fu
  ;;   :bind ("C-M-r" . undo-fu-only-redo)
  ;;   ("C-z" . undo-fu-only-undo)
  ;;   ("C-S-z" . undo-fu-only-redo-all))

  (use-package undo-fu-session
    :init (undo-fu-session-global-mode)
    :config
    (setq undo-fu-session-incompatible-files '("/COMMIT_EDITMSG\\'" "/git-rebase-todo\\'")))

  (use-package vundo
    :bind (("C-x u" . vundo)
           ("C-z" . undo-only)
           ("C-S-z" . undo-redo)
           ("C-M-r" . undo-redo)))

  (use-package flycheck
    :defer t
    :hook (prog-mode . flycheck-mode))
  ;; :init (global-flycheck-mode))

  (use-package mingus
    :defer t
    :bind ("C-c d m" . mingus-browse)
    (:map mingus-browse-mode-map
          ("h" . mingus-browse-top-level)
          ("l" . mingus-down-dir-or-play-song))
    :config
    (advice-add 'mingus-playlist-mode :after #'olivetti-mode)
    (advice-add 'mingus-browse-mode :after #'olivetti-mode))
  ;; (use-package wikinforg)

  (use-package webpaste
    :defer t
    :ensure t
    :bind (("C-c C-p C-b" . webpaste-paste-buffer)
           ("C-c C-p C-r" . webpaste-paste-region)
           ("C-c C-p C-p" . webpaste-paste-buffer-or-region))
    :config
    (setq webpaste-provider-priority '("dpaste.org" "dpaste.com" "paste.mozilla.org"))
    ;; Require confirmation before doing paste
    (setq webpaste-paste-confirmation t))

  (use-package sdcv
    :hook (sdcv-mode . hide-mode-line-mode)
    :config
    (setq sdcv-say-word-p t
          sdcv-dictionary-data-dir "~/d-git/d-bin/treasure/dict/"
          sdcv-dictionary-simple-list
          '("wn" "mw-thesaurus" "enjp")
          sdcv-popup-function 'popup-tip
          sdcv-buffer-name "StarDict")
    :bind (("C-c d w" . sdcv-search-input)
           ("C-c d d" . sdcv-search-input+))
    (:map sdcv-mode-map
          ("q" . kill-buffer-and-window)
          ("n" . sdcv-next-dictionary)
          ("TAB" . hide-entry)
          ("<backtab>" . show-entry)
          ("p" . sdcv-previous-dictionary)))


#+end_src
* ✨ Apps
** 📚 Epub - Nov
Nov is one of the gem which really makes epub reading more sense in emacs; Embrace the Text!
You dont have to learn another software or ask for features, get it in emacs-way.
#+begin_src emacs-lisp
  (use-package nov
    :config
    (add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode))
    (setq nov-text-width t))
#+end_src

