d-emacs.org
** </> Shrface - Orgify
To make eww and shr elements org-like and make emacs even more Unified!
#+begin_src emacs-lisp
  (defun shrface-default-keybindings ()
    (interactive)
    "Sets up the default keybindings for `shrface-mode'."
    (define-key shrface-mode-map (kbd "TAB") 'shrface-outline-cycle)
    (define-key shrface-mode-map (kbd "<backtab>") 'shrface-outline-cycle-buffer)
    (define-key shrface-mode-map (kbd "C-t") 'shrface-toggle-bullets)
    (define-key shrface-mode-map (kbd "C-j") 'shrface-next-headline)
    (define-key shrface-mode-map (kbd "C-k") 'shrface-previous-headline)
    (define-key shrface-mode-map (kbd "M-l") 'shrface-links-consult)
    (define-key shrface-mode-map (kbd "M-h") 'shrface-headline-consult))

  (use-package shrface
    :defer t
    :init
    (setq shrface-item-bullet 8226)
    :bind (:map shrface-mode-map
                ("<tab>" . shrface-outline-cycle)
                ("<backtab>" . shrface-outline-cycle-buffer)
                ("M-l" . shrface-links-consult)
                ("M-h" . shrface-headline-consult)
                ("C-j" . shrface-next-headline)
                ("C-k" . shrface-previous-headline))
    :config
    (shrface-basic)
    (shrface-trial)
    (setq shrface-bullets-bullet-list org-modern-star)
    (setq shrface-href-versatile t))

  (use-package eww
    :defer t
    :init
    (add-hook 'eww-after-render-hook #'shrface-mode))

  (use-package nov
    :defer t
    :init
    (add-hook 'nov-mode-hook #'shrface-mode)
    :config
    (setq nov-shr-rendering-functions '((img . nov-render-img) (title . nov-render-title)))
    (setq nov-shr-rendering-functions (append nov-shr-rendering-functions shr-external-rendering-functions)))

  ;; To highligh src blocks in eww
  (use-package shr-tag-pre-highlight
    :ensure t
    :after shr
    :config

  (defun shrface-shr-tag-pre-highlight (pre)
      "Highlighting code in PRE."
      (let* ((shr-folding-mode 'none)
             (shr-current-font 'default)
             (code (with-temp-buffer
                     (shr-generic pre)
                     ;; (indent-rigidly (point-min) (point-max) 2)
                     (buffer-string)))
             (lang (or (shr-tag-pre-highlight-guess-language-attr pre)
                       (let ((sym (language-detection-string code)))
                         (and sym (symbol-name sym)))))
             (mode (and lang
                        (shr-tag-pre-highlight--get-lang-mode lang))))
        (shr-ensure-newline)
        (shr-ensure-newline)
        (setq start (point))
        (insert
         (propertize (concat "#+BEGIN_SRC " lang "\n") 'face 'org-block-begin-line)
         (or (and (fboundp mode)
                  (with-demoted-errors "Error while fontifying: %S"
                    (shr-tag-pre-highlight-fontify code mode)))
             code)
         (propertize "#+END_SRC" 'face 'org-block-end-line ))
        (shr-ensure-newline)
        (setq end (point))
        (if light
            (add-face-text-property start end '(:background "#D8DEE9" :extend t))
          (add-face-text-property start end '(:background "#292b2e" :extend t)))
        (shr-ensure-newline)
        (insert "\n")))

    (add-to-list 'shr-external-rendering-functions
                 '(pre . shr-tag-pre-highlight))
    (when (version< emacs-version "26")
      (with-eval-after-load 'eww
        (advice-add 'eww-display-html :around
                    'eww-display-html--override-shr-external-rendering-functions))))



#+end_src

** 📎 Document - The PDF
Pdf-tools is another great addition if you want to integrate well with Emacs.
#+begin_src emacs-lisp
  (use-package pdf-tools
    :defer t
    :init
    (pdf-tools-install)
    :bind (:map pdf-view-mode-map
                ("h" . pdf-annot-add-highlight-markup-annotation)
                ("t" . pdf-annot-add-text-annotation)
                ("D" . pdf-annot-delete)
                ("i" . pdf-view-midnight-minor-mode)
                ("Q" . d/kill-buffer))

    :config
    (setq pdf-tools-enabled-modes         ; simplified from the defaults
          '(pdf-history-minor-mode
            pdf-isearch-minor-mode
            pdf-links-minor-mode
            pdf-outline-minor-mode
            pdf-misc-size-indication-minor-mode
            pdf-occur-global-minor-mode))
    (setq pdf-view-display-size 'fit-page) ;;fit-height
    (setq pdf-view-continuous t)
    (setq pdf-cache-image-limit 3)
    (setq large-file-warning-threshold 700000000)
    (setq pdf-cache-prefetch-delay 0.5)
    (setq image-cache-eviction-delay 3)
    (setq pdf-annot-activate-created-annotations t)
    (setq pdf-view-use-dedicated-register nil)
    (setq pdf-view-max-image-width 2000)
    (add-hook 'pdf-view-mode-hook (lambda () (cua-mode 0)))
    (define-key pdf-view-mode-map (kbd "C-s") 'isearch-forward)
    (define-key pdf-view-mode-map (kbd "M-g g") 'pdf-view-goto-page)
    (setq pdf-outline-imenu-use-flat-menus t)
    (setq pdf-view-resize-factor 1.1))


  (defun d/kill-buffer ()
    "Clear the image cache (to release memory) after killing a pdf buffer."
    (interactive)
    (if (one-window-p) (kill-this-buffer)
      (kill-buffer-and-window))
    (clear-image-cache t)
    (pdf-cache-clear-data))

  (define-key image-mode-map (kbd "q") 'd/kill-buffer)

  ;; For Comic Manga
  (add-hook 'image-mode-hook (lambda ()
                               (olivetti-mode)
                               (setq olivetti-body-width 0.45)))

  (use-package man
    :bind (("C-c m" . consult-man)
           :map Man-mode-map
           ("q" . kill-buffer-and-window)))

#+end_src
* 🏅 Functions Mania
Some more functions copied and adapted well to my flow. You will also find it well.
#+begin_src emacs-lisp
  (defun config-reload ()
    "Uncle dev created a function to reload Emacs config."
    (interactive)
    (load-file (expand-file-name "~/.config/emacs/init.el")))

  ;; Bionic Reading

  (defvar bionic-reading-face nil "a face for `d/bionic-region'.")
  (setq bionic-reading-face 'bold)
  ;; try
  ;; 'bold
  ;; 'error
  ;; 'warning
  ;; 'highlight
  ;; or any value of M-x list-faces-display

  (defun d/bionic-read ()
    "Bold the first few chars of every word in current buffer.
        Version 2022-05-21"
    (interactive)
    (read-only-mode -1)
    (d/bionic-region (point-min) (point-max))
    (read-only-mode 1)
    (beginning-of-buffer))

  (defun d/bionic-region (Begin End)
    "Bold the first few chars of every word in region.
        Version 2022-05-21"
    (interactive "r")
    (let (xBounds xWordBegin xWordEnd  )
      (save-restriction
        (narrow-to-region Begin End)
        (goto-char (point-min))
        (while (forward-word)
          ;; bold the first half of the word to the left of cursor
          (setq xBounds (bounds-of-thing-at-point 'word))
          (setq xWordBegin (car xBounds))
          (setq xWordEnd (cdr xBounds))
          (setq xBoldEndPos (+ xWordBegin (1+ (/ (- xWordEnd xWordBegin) 2))))
          (put-text-property xWordBegin xBoldEndPos
                             'font-lock-face bionic-reading-face)))))

  ;; From kathink. It repeats the seq without modifier
  (defun repeated-prefix-help-command ()
    (interactive)
    (when-let* ((keys (this-command-keys-vector))
                (prefix (seq-take keys (1- (length keys))))
                (orig-keymap (key-binding prefix 'accept-default))
                (keymap (copy-keymap orig-keymap))
                (exit-func (set-transient-map keymap t #'which-key-abort)))
      (define-key keymap [remap keyboard-quit]
        (lambda () (interactive) (funcall exit-func)))
      (which-key--create-buffer-and-show nil keymap)))

  (setq prefix-help-command #'repeated-prefix-help-command)

  ;; This is for managing nixos config
  (defun get-named-src-block-contents (name &optional trim)
  "Return the contents of the named Org source block."
  (let* ((block (org-element-map (org-element-parse-buffer) 'src-block
                  (lambda (src-block)
                    (when (string= name (org-element-property :name src-block))
                        src-block))
                  nil t))
         (source (org-element-property :value block)))
    (if trim
        (string-trim source)
      source)))

#+end_src

