d-emacs.org
* 📰 Rss - Better Web
Use RSS, just switch to it, and save your time for other productive things. If you wanna follow lazy people and hit that 'like, share and subscribe button, and /ding/ the bell icon' and what not, go on.
#+begin_src emacs-lisp
    (use-package elfeed
      :defer t
      :hook (elfeed-show-mode . d/elfeed-ui)
      :bind ("C-c d e" . elfeed)
      ("C-c d b" . d/external-browser)
      (:map elfeed-show-mode-map
            ("e" . elfeed-open-in-eww)
            ("i" . d/bionic-read)
            ("r" . elfeed-open-in-reddit)
            ("m" . elfeed-toggle-show-star)
            ("b" . d/external-browser))
      (:map elfeed-search-mode-map
            ("m" . elfeed-toggle-star)
            ("U" . elfeed-update)
            ("u" . elfeed-update-feed))
      :config
      ;; (setq-default elfeed-search-filter "@1-week-ago--1-day-ago +unread -news +")
      (setq-default elfeed-search-filter "+unread +")
      (setq elfeed-search-date-format `("%m-%d 📰" 7 :left))
      (setq elfeed-search-title-max-width 90
            elfeed-search-trailing-width 0)
      (defalias 'elfeed-toggle-show-star
        (elfeed-expose #'elfeed-show-tag 'star))
      (defalias 'elfeed-toggle-star
        (elfeed-expose #'elfeed-search-toggle-all 'star))

      (defun d/elfeed-ui ()
        (interactive)
        (setq-local header-line-format " "))


      ;; face for starred articles
      (defface elfeed-search-star-title-face
        '((t :foreground "#f77"))
        "Marks a starred Elfeed entry.")

      (push '(star elfeed-search-star-title-face) elfeed-search-face-alist))

    (use-package link-hint
      :defer t
      :ensure t
      :bind
      ("C-c l o" . link-hint-open-link)
      ("C-c l c" . link-hint-copy-link))

    (use-package avy
      :defer t
      :bind
      ("M-j" . avy-goto-char-timer)
      ("M-K" . avy-kill-region)
      ("C-S-k" . avy-kill-whole-line)
      :config
      (setq avy-background t))

    (use-package elfeed-org
      :after elfeed
      :config
      (elfeed-org)
      (setq rmh-elfeed-org-files (list "~/.config/emacs/elfeed.org")))

    (defun readable-article ()
      (interactive)
      (eww-readable)
      ;; (d/bionic-read)
      (beginning-of-buffer)
      (d/eww-rename-buffer))

    (defun elfeed-open-in-eww ()
      "open in eww"
      (interactive)
      (let ((entry (if (eq major-mode 'elfeed-show-mode) elfeed-show-entry (elfeed-search-selected :single))))
        (eww (elfeed-entry-link entry))
        (add-hook 'eww-after-render-hook 'readable-article)))

    (defun elfeed-open-in-reddit ()
      "open in reddit"
      (interactive)
      (let ((entry (if (eq major-mode 'elfeed-show-mode) elfeed-show-entry (elfeed-search-selected :single))))
        (reddigg-view-comments (elfeed-entry-link entry))))

  (use-package eww
    :bind (:map eww-mode-map
                ("e" . readable-article)
                ("Q" . d/kill-buffer)
                ("M-v" . d/scroll-up)
                ("C-v" . d/scroll-down)
                ("F" . d/visit-urls)
                ("b" . d/external-browser))
    :config
    (setq shr-bullet "• "
          shr-folding-mode t
          url-privacy-level '(email agent cookies lastloc))

    (defvar consult--source-eww
      (list
       :name     "Eww"
       :narrow   ?e
       :action   (lambda (bm)
                   (eww-browse-url (get-text-property 0 'url bm)))
       :items    (lambda ()
                   (eww-read-bookmarks)
                   (mapcar (lambda (bm)
                             (propertize
                              (format "%s (%s)"
                                      (plist-get bm :url)
                                      (plist-get bm :title))
                              'url (plist-get bm :url)))
                           eww-bookmarks))))
  (add-to-list 'consult-buffer-sources 'consult--source-eww 'append))

  (use-package gnutls
    :defer t
    :custom
    (gnutls-verify-error t))


  (with-eval-after-load "shr"
      (defun shr-put-image (spec alt &optional flags)
        "Insert image SPEC with a string ALT.  Return image.
  SPEC is either an image data blob, or a list where the first
  element is the data blob and the second element is the content-type.
  Hack to use `insert-sliced-image' to avoid jerky image scrolling."
        (if (display-graphic-p)
            (let* ((size (cdr (assq 'size flags)))
                   (data (if (consp spec)
                             (car spec)
                           spec))
                   (content-type (and (consp spec)
                                      (cadr spec)))
                   (start (point))
                   (image (cond
                           ((eq size 'original)
                            (create-image data nil t :ascent 100
                                          :format content-type))
                           ((eq content-type 'image/svg+xml)
                            (create-image data 'svg t :ascent 100))
                           ((eq size 'full)
                            (ignore-errors
                              (shr-rescale-image data content-type
                                                 (plist-get flags :width)
                                                 (plist-get flags :height))))
                           (t
                            (ignore-errors
                              (shr-rescale-image data content-type
                                                 (plist-get flags :width)
                                                 (plist-get flags :height)))))))
              (when image
                (let* ((image-pixel-cons (image-size image t))
                       (image-pixel-width (car image-pixel-cons))
                       (image-pixel-height (cdr image-pixel-cons))
                       (image-scroll-rows (round (/ image-pixel-height (default-font-height)))))
                  ;; When inserting big-ish pictures, put them at the
                  ;; beginning of the line.
                  (when (and (> (current-column) 0)
                             (> (car (image-size image t)) 400))
                    (insert "\n"))

                  (insert-sliced-image image (or alt "*") nil image-scroll-rows 1)
                  ;; (if (eq size 'original)
                  ;;     (insert-sliced-image image (or alt "*") nil image-scroll-rows 1)
                  ;;   (insert-image image (or alt "*")))

                  (put-text-property start (point) 'image-size size)
                  (when (and shr-image-animate
                             (cond ((fboundp 'image-multi-frame-p)
                                    ;; Only animate multi-frame things that specify a
                                    ;; delay; eg animated gifs as opposed to
                                    ;; multi-page tiffs.  FIXME?
                                    (cdr (image-multi-frame-p image)))
                                   ((fboundp 'image-animated-p)
                                    (image-animated-p image))))
                    (image-animate image nil 60))))
              image)
          (insert (or alt "")))))


#+end_src

** Enhanced Rss experience
Make lot of betterment with reading workflow. Again, you save more time.
Congratulations, if you are already using Rss, if not, don't worry, you can get started with some good info.
#+begin_src emacs-lisp
  (defun d/external-browser ()
    (interactive)
    (if (or (thing-at-point 'url t) (thing-at-point 'filename t) (shr-url-at-point nil) (image-at-point-p))
        (link-hint-copy-link-at-point)
      (link-hint-copy-link))
    (let ((url (current-kill 0)))
      (browse-url-generic url)))

  (defun d/eww-rename-buffer ()
    "Rename EWW buffer using page title or URL.
      To be used by `eww-after-render-hook'."
    (let ((name (if (eq "" (plist-get eww-data :title))
                    (plist-get eww-data :url)
                  (plist-get eww-data :title))))
      (rename-buffer (substring (format "*%s # eww*" name)0 32) t)))

  (add-hook 'eww-after-render-hook #'d/eww-rename-buffer)
  (advice-add 'eww-back-url :after #'d/eww-rename-buffer)
  (advice-add 'eww-forward-url :after #'d/eww-rename-buffer)
  ;; (advice-add 'eww-readable :after #'d/bionic-read)

#+end_src

