gdk/i-home/configs/emacs/init.el

(use-package ement
  :hook (ement-room-compose . ement-room-compose-org)
  :bind (:map ement-room-minibuffer-map
              ("<f6>" . ement-room-compose-from-minibuffer))
  (:map ement-room-mode-map
        ("M-<" . ement-room-scroll-down-command))
  :config
  (setq ement-room-send-message-filter 'ement-room-send-org-filter)
  (setq ement-room-message-format-spec "%S> %L%B%r%R%t")
  (setq ement-room-list-avatars nil))

(use-package ox-hugo
  :after ox)

(setq inhibit-startup-message t)

(scroll-bar-mode -1)        ; Disable visible scrollbar
(tool-bar-mode -1)          ; Disable the toolbar
(tooltip-mode -1)           ; Disable tooltips
(setq set-fringe-style "default")        ; Give some breathing room

(menu-bar-mode -1)            ; Disable the menu bar

;; (setq-default mode-line-format nil)

;; (server-start)

(visual-line-mode 1)

;; Display messages when idle, without prompting
(setq help-at-pt-display-when-idle t)
(setopt read-quoted-char-radix 16)
(setq use-dialog-box nil)
(setopt set-mark-command-repeat-pop t)
(setq sentence-end-double-space nil)
(setq sentence-end "[.?!] ")
(setq-default indent-tabs-mode nil)
(setq save-interprogram-paste-before-kill t)
(setq kill-do-not-save-duplicates t)
(setq initial-scratch-message
      ";; Type to your Will !\n\n")

(setq frame-inhibit-implied-resize t)
;;(global-prettify-symbols-mode t)

;; tabs
(setq tab-bar-new-tab-choice "*scratch")
(setq tab-bar-close-button-show nil
      tab-bar-new-button-show nil)

(setq vc-follow-symlinks t)

;; Set up the visible bell
(setq visible-bell nil)

;; Wayland
(setq x-select-request-type 'text/plain\;charset=utf-8)

(set-language-environment "UTF-8")
(set-default-coding-systems 'utf-8)
(set-keyboard-coding-system 'utf-8-unix)
(set-terminal-coding-system 'utf-8-unix)

(electric-pair-mode t)
(setq electric-pair-inhibit-predicate 'ignore)
(setq electric-pair-skip-self t)

(setq recenter-positions '(top middle bottom))
(global-display-line-numbers-mode t)
(setq  display-line-numbers-type 'relative)
(setq text-scale-mode-step 1.1)
(setq frame-resize-pixelwise t)
(global-hl-line-mode 1)
(column-number-mode -1)
(line-number-mode 1)
(delete-selection-mode +1)
(save-place-mode t)

;;(display-battery-mode t)
;;(setq display-time;5;9~-default-load-average nil)
;;(setq display-time-24hr-format t)
;;(setq display-time-format "%H:%M")
;;(display-time-mode t)
;;(toggle-truncate-lines t)

(setq
 shr-use-fonts  t                          ; No special fonts
 shr-use-colors t                          ; No colours
 shr-indentation 4                           ; Left-side margin
 shr-max-width fill-column
 shr-max-image-proportion 0.2
 shr-width 100                                ; Fold text to 70 columns
 eww-search-prefix "https://lite.duckduckgo.com/lite/?q=")

;; Set frame transparency
(set-frame-parameter (selected-frame) 'alpha-background 90)
(add-to-list 'default-frame-alist `(alpha-background . 90))
(set-frame-parameter (selected-frame) 'fullscreen 'maximized)
(add-to-list 'default-frame-alist '(fullscreen . maximized))

;; Disable line numbers for some modes
(dolist (mode '(org-mode-hook
                vterm-mode-hook
                term-mode-hook
                shell-mode-hook
                olivetti-mode-hook
                treemacs-mode-hook
                pdf-view-mode-hook
                archive-mode-hook
                image-mode-hook
                elfeed-show-mode-hook
                elfeed-search-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

(blink-cursor-mode -1)

;; Don't blink the paren matching the one at point, it's too distracting.
(setq blink-matching-paren nil)

;; A simple frame title
(setq frame-title-format '("%b")
      icon-title-format frame-title-format)

;; Don't resize the frames in steps; it looks weird, especially in tiling window
;; managers, where it can leave unseemly gaps.
(setq frame-resize-pixelwise t)
(setq pixel-dead-time 10000)
(setq confirm-kill-emacs #'yes-or-no-p)
(setq window-resize-pixelwise t)
(setq frame-resize-pixelwise t)

(setq fill-column 100)

(if (daemonp)
    (add-hook 'after-make-frame-functions
              (lambda (frame)
                (setq doom-modeline-icon t)
                (with-selected-frame frame
                  (d/set-font-faces))))
    (d/set-font-faces))
(setq doom-modeline-icon t)
 (put 'narrow-to-region 'disabled nil)
